cask_args appdir: '/Applications'

# Install brew packages
tap 'AdoptOpenJDK/openjdk'
tap 'homebrew/cask-fonts'
tap 'daipeihust/tap'

brew 'git'
brew 'coreutils'
brew 'curl'
brew 'tig'
brew 'gh'
brew 'vim'
brew 'neovim'
brew 'asdf'
brew 'mas'
brew 'yarn'
brew 'tmux'
brew 'tmuxinator'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'watch'
brew 'htop'
brew 'zsh-completions'
brew 'bash-completion'
brew 'jq'
brew 'mecab'
brew 'mysql'
# brew 'postgresql@xx' # need to specify the version
brew 'redis'
brew 'openssl'
brew 'ruby-build'
brew 'readline'
brew 'ag'
brew 'ripgrep'
brew 'imagemagick'
brew 'libmagic'
brew 'font-source-code-pro'
brew 'ansible'
brew 'peco'
brew 'pstree'
brew 'ffmpeg'
brew 'parallel'
brew 'pipx'
brew 'bat'
brew 'gdb'
brew 'qemu'
brew 'automake'
brew 'cmake'
brew 'zlib'
brew 'kubectx'
brew 'stern'
brew 'mutagen-io/mutagen/mutagen-compose'
brew 'k1LoW/tap/tbls'
brew 'marp-cli'
brew 'im-select'

# https://github.com/universal-ctags/homebrew-universal-ctags
# brew install --HEAD universal-ctags/universal-ctags/universal-ctags

# Install cask packages
# cask 'iterm2' # insatll manually
# cask 'dropbox' # install manually
cask 'google-chrome'
cask 'firefox'
cask 'brave-browser'
cask 'alfred'
cask 'the-unarchiver'
cask 'react-native-debugger'
cask 'dash'
cask 'visual-studio-code'
cask 'cursor'
cask 'intellij-idea'
cask 'docker'
cask 'obsidian'
cask 'slack'
cask 'zoom'
cask 'vlc'
cask 'kindle'

# Need to use rosetta
cask 'google-japanese-ime'
cask 'adoptopenjdk11'
cask 'avidemux'
cask 'freefilesync'
cask 'handbrake'
