cask_args appdir: '/Applications'

# Install brew packages
tap 'adoptopenjdk/openjdk'
tap 'homebrew/cask-fonts'
tap 'daipeihust/tap'

brew 'git'
brew 'coreutils'
brew 'curl'
brew 'tig'
brew 'gh'
brew 'vim'
brew 'neovim'
brew 'asdf'
brew 'mas'
brew 'yarn'
brew 'tmux'
brew 'tmuxinator'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'watch'
brew 'htop'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'bash-completion'
brew 'jq'
brew 'yq'
brew 'mecab'
brew 'mysql'
# brew 'postgresql@xx' # need to specify the version
brew 'redis'
brew 'ruby-build'
brew 'readline'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'imagemagick'
brew 'libmagic'
brew 'ansible'
brew 'peco'
brew 'pstree'
brew 'ffmpeg'
brew 'parallel'
brew 'pipx'
brew 'bat'
brew 'gdb'
brew 'qemu'
brew 'automake'
brew 'cmake'
brew 'zlib'
brew 'kubectx'
brew 'kustomize'
brew 'argoproj/tap/argocd'
brew 'krew'
brew 'helm'
brew 'stern'
brew 'mutagen-io/mutagen/mutagen-compose'
brew 'kayac/tap/ecspresso'
brew 'fujiwara/tap/tfstate-lookup'
brew 'k1LoW/tap/tbls'
brew 'marp-cli'
brew 'im-select'
brew 'terminal-notifier'
brew 'direnv'
brew 'gnu-sed'
brew 'yukiarrr/tap/ecsk'
brew 'cue'
brew 'cloc'
brew 'cloudflared'
brew 'FairwindsOps/tap/pluto'
brew 'chromium'
brew 'llvm'
brew 'azure-cli'
brew 'graphviz'
brew 'libpq'
brew 'repomix'
brew 'pandoc'
brew 'basictex'
brew 'codex'

# https://github.com/universal-ctags/homebrew-universal-ctags
# brew install --HEAD universal-ctags/universal-ctags/universal-ctags

# Install cask packages
# cask 'iterm2' # insatll manually
# cask 'dropbox' # install manually
cask 'google-chrome'
cask 'firefox'
cask 'brave-browser'
cask 'claude-code'
cask 'clipy'
cask 'the-unarchiver'
cask 'react-native-debugger'
cask 'dash'
cask 'visual-studio-code'
cask 'cursor'
cask 'intellij-idea'
cask 'docker'
cask 'obsidian'
cask 'slack'
cask 'zoom'
cask 'vlc'
cask 'kindle'
cask 'raycast'
cask 'session-manager-plugin' # for ecspresso
cask 'temurin'

# Need to use rosetta
cask 'google-japanese-ime'
cask 'adoptopenjdk11'
cask 'avidemux'
cask 'freefilesync'
cask 'handbrake'
cask 'gcloud'
cask 'ghostty'

cask 'font-source-han-code-jp'
cask 'font-source-code-pro'
