cask_args appdir: '/Applications'

# Install brew packages
tap 'heroku/brew'
tap 'sanemat/font'
tap 'AdoptOpenJDK/openjdk'
tap 'homebrew/cask-fonts'

brew 'git'
brew 'coreutils'
brew 'tig'
brew 'hub'
brew 'gh'
brew 'vim'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'curl'
brew 'zsh'
brew 'watch'
brew 'htop'
brew 'zsh-completions'
brew 'bash-completion'
brew 'heroku'
brew 'ctags'
brew 'jq'
brew 'jenkins'
brew 'mecab'
brew 'mysql'
brew 'postgresql'
brew 'redis'
brew 'rbenv'
brew 'nvm'
brew 'rbenv-bundler'
brew 'ruby-build'
brew 'reattach-to-user-namespace'
brew 'openssl'
brew 'the_silver_searcher'
brew 'readline'
brew 'imagemagick'
brew 'libmagic'
brew 'ricty'
brew 'ansible'
brew 'peco'
brew 'go'
brew 'rust'
brew 'kotlin'
brew 'maven'
brew 'glide'
brew 'direnv'
brew 'pstree'
brew 'qemu'
brew 'ffmpeg'
brew 'parallel'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'bat'
brew 'gdb'
brew 'automake'
brew 'terraform'
brew 'cmake'
brew 'macvim'
brew 'zlib'
brew 'hugo'
brew 'docker-machine'
brew 'minikube'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'tfenv'

# Install cask packages
cask 'adoptopenjdk8'
cask 'google-chrome'
cask 'firefox'
# cask virtualbox
# cask vagrant
# cask appcleaner
cask 'alfred'
# cask filezilla
cask 'dropbox'
cask 'evernote'
cask 'imageoptim'
# cask xtrafinder
cask 'the-unarchiver'
cask 'react-native-debugger'
cask 'font-ricty-diminished'
cask 'dash'
