anthropic.claude-code
asvetliakov.vscode-neovim
bbenoist.shell
bung87.rails
bung87.vscode-gemfile
charliermarsh.ruff
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
denoland.vscode-deno
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
golang.go
hashicorp.terraform
infeng.vscode-react-typescript
ionutvmi.path-autocomplete
kaiwood.endwise
koichisasada.vscode-rdbg
marp-team.marp-vscode
mechatroner.rainbow-csv
mosapride.zenkaku
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
msjsdiag.vscode-react-native
mylesmurphy.prettify-ts
redhat.vscode-yaml
rooveterinaryinc.roo-cline
saoudrizwan.claude-dev
shopify.ruby-extensions-pack
shopify.ruby-lsp
sianglim.slim
skyran.js-jsx-snippets
tomsaunders.vscode-workspace-explorer
vscode-icons-team.vscode-icons
yzhang.markdown-all-in-one
